---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystem.PipingNetwork
source: html/fd5c6d0f-3c77-6afd-a752-5ee7c7b8e1a1.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.PipingNetwork Property

Pipes and fittings which are contained in this system.

## Syntax (C#)
```csharp
public ElementSet PipingNetwork { get; }
```

## Remarks
The return value doesn't include mechanical equipment elements.
The pipes and fittings are not returned in any particular order.